# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

# Import pandas, numpy, matplotlib and seaborn

In [372]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

Playing around with some jupyter commands:

In [373]:
S = pd.Series([1.0,1.5,3.0,4.3,8.2])

In [374]:
S[2]

3.0

In [375]:
S

0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

In [376]:
S.values

array([ 1. ,  1.5,  3. ,  4.3,  8.2])

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [377]:
t = pd.DataFrame({
        #"Index" : range(1,6),
        "a" : range(2,7),
        "b" : [3,1,9,12,2],
        "c" : [5.0, 1.4, 1.2, 0.8, 2.3],
        "d" : ["horse", "cat", "dog", "tortoise", "rabbit"],
        "e" : [13, 11, np.nan, np.nan, 9]
    }, index=range(1,6))

In [378]:
t

   a   b    c         d     e
1  2   3  5.0     horse  13.0
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN
5  6   2  2.3    rabbit   9.0

Access the values of row 2:

In [379]:
t.loc[2]

a      3
b      1
c    1.4
d    cat
e     11
Name: 2, dtype: object

Access single cell (A2):

In [380]:
t["a"][2]

3

Print index and column names:

In [381]:
"Index:", t.index.values, "Column names", list(t)

('Index:', array([1, 2, 3, 4, 5]), 'Column names', ['a', 'b', 'c', 'd', 'e'])

In [382]:
list(t)

['a', 'b', 'c', 'd', 'e']

Access values of column 3:

In [383]:
t["d"].values

array(['horse', 'cat', 'dog', 'tortoise', 'rabbit'], dtype=object)

Rename a column:

In [384]:
t.rename(columns={"b": "New"},inplace=True)

In [385]:
t

   a  New    c         d     e
1  2    3  5.0     horse  13.0
2  3    1  1.4       cat  11.0
3  4    9  1.2       dog   NaN
4  5   12  0.8  tortoise   NaN
5  6    2  2.3    rabbit   9.0

Extract rows 2-4 as new dataframe

In [386]:
t2 = t.ix[2:4,:].copy()

In [387]:
t2

   a  New    c         d     e
2  3    1  1.4       cat  11.0
3  4    9  1.2       dog   NaN
4  5   12  0.8  tortoise   NaN

In [388]:
t.describe()

              a        New         c     e
count  5.000000   5.000000  5.000000   3.0
mean   4.000000   5.400000  2.140000  11.0
std    1.581139   4.827007  1.690562   2.0
min    2.000000   1.000000  0.800000   9.0
25%    3.000000   2.000000  1.200000   NaN
50%    4.000000   3.000000  1.400000   NaN
75%    5.000000   9.000000  2.300000   NaN
max    6.000000  12.000000  5.000000  13.0

# Data Import

Import the following file into a dataframe _df2_:

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D

In [389]:
df2 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D")

In [390]:
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D

Since this file is semicolon-separated, the input needs to be adapted (sep=";"):

In [419]:
df3 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D",sep=";")

In [392]:
df3

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

select rows containing values greater than 2 in the 3rd column

In [393]:
df3[(df3.ix[:,2]> 2)]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
4  6  2  2.3  rabbit   9.0

select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column

In [394]:
df3[(df3.ix[:,2]> 2) | (df3.ix[:,3] == "cat")]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

Drop rows with missing data:

In [395]:
df3.dropna(how="any", inplace=True)

Drop duplicates:

In [396]:
df3.drop_duplicates(inplace=True)

Drop 1st column from dataframe:

In [397]:
df3.drop(df3.columns.values[0],axis=1,inplace=True)

Sort rows by 2nd column:

In [398]:
df3.sort_values(df3.columns.values[1],inplace=True)

In [399]:
df3

   b    c       d     e
1  1  1.4     cat  11.0
4  2  2.3  rabbit   9.0
0  3  5.0   horse  13.0

Convert Strings in 4th column to title-case:

In [400]:
df3.d = df3["d"].str.title()

In [417]:
df3

   b    c       d     e
1  1  1.4     Cat  11.0
4  2  2.3  Rabbit   9.0
0  3  5.0   Horse  13.0

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [402]:
df3.to_csv("df3.txt", sep="\t", index=False)

# DataFrame aggregation

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [418]:
df4 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/Integrated_Bioinformatics/master/example_data/df4.csv")

In [404]:
df4_grouped = df4.groupby("b")

In [405]:
df4_grouped.agg(np.mean)

                c     e
b
fish     0.900000  10.0
mammal   2.533333  12.0
reptile  2.300000   9.0

In [406]:
df4_grouped.agg({"c": {"min":np.min, "max":np.max}})

           c
         max  min
b
fish     1.8  0.1
mammal   5.0  1.2
reptile  2.3  2.3

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [426]:
m = pd.merge(df3, df4, on=["c","d","e"], suffixes=('_3', '_4'))
m

   a  b_3    c      d     e     b_4
0  2    3  5.0  horse  13.0  mammal
1  3    1  1.4    cat  11.0  mammal
2  4    9  1.2    dog   NaN  mammal

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [443]:
joined = pd.merge(df3,df4,how="outer")

In [445]:
joined

      a        b    c         d     e
0   2.0        3  5.0     horse  13.0
1   3.0        1  1.4       cat  11.0
2   4.0        9  1.2       dog   NaN
3   5.0       12  0.8  tortoise   NaN
4   6.0        2  2.3    rabbit   9.0
5   NaN   mammal  5.0     horse  13.0
6   NaN   mammal  1.4       cat  11.0
7   NaN   mammal  1.2       dog   NaN
8   NaN     fish  0.1  goldfish   NaN
9   NaN  reptile  2.3     snake   9.0
10  NaN     fish  1.8       koi  10.0
11  NaN     fish  0.8      carp   NaN